# FilterStringEquals Class

---
Tests whether string values from the document match a certain string.
SystemObject Autodesk.Revit.DBFilterStringRuleEvaluator Autodesk.Revit.DBFilterStringEquals
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

    public class FilterStringEquals : FilterStringRuleEvaluator

    Public Class FilterStringEquals
    	Inherits FilterStringRuleEvaluator

    public ref class FilterStringEquals : public FilterStringRuleEvaluator

    type FilterStringEquals =
        class
            inherit FilterStringRuleEvaluator
        end
The FilterStringEquals type exposes the following members.
| Name| Description
---|---|---
| FilterStringEquals|  Constructs an instance of FilterStringEquals.
Top
| Name| Description
---|---|---
| IsValidObject|  Specifies whether the .NET object represents a valid Revit entity. (Inherited from FilterStringRuleEvaluator)
Top
| Name| Description
---|---|---
| Dispose| (Inherited from FilterStringRuleEvaluator)
| Equals| Determines whether the specified object is equal to the current object.(Inherited from Object)
| Evaluate|  Derived classes override this method to implement the test that determines whether the two given string values satisfy the desired condition or not. (Inherited from FilterStringRuleEvaluator)
| GetHashCode| Serves as the default hash function.(Inherited from Object)
| GetType| Gets the Type of the current instance.(Inherited from Object)
| ToString| Returns a string that represents the current object.(Inherited from Object)
Top
All string comparisons in this class are performed in the case-insensitive manner.
#### Reference
Autodesk.Revit.DB Namespace